// ННГУ, ВМК, Курс "Методы программирования-2", С++, ООП
//
// sample_matrix.cpp - Copyright (c) Гергель В.П. 07.05.2001
//   Переработано для Microsoft Visual Studio 2008 Сысоевым А.В. (20.04.2015)
//
// Тестирование верхнетреугольной матрицы

#include <iostream>
#include "utmatrix.h"
//---------------------------------------------------------------------------

void main()
{
  TMatrix<int> m1(4), b(3), c(3);
  
  m1[0][0] = 10;
  m1[0][1] = 20;
  m1[0][2] = 30;
  m1[0][3] = 100;
  m1[1][1] = 40;
  m1[1][2] = 50;
  m1[1][3] = 150;
  m1[2][2] = 60;
  m1[2][3] = 200;
  m1[3][3] = 250;
  //c = a + b;
  cout << "Matrix a = " << endl << m1 << endl;
  //cout << "Matrix b = " << endl << b << endl;
  //cout << "Matrix c = a + b" << endl << c << endl;
}
//---------------------------------------------------------------------------
